// 4. კომენტარის სახით დაწერეთ რა არის let, const, var.


// 
//    var (variable) -- არის keyword, რომლითაც შეგვიძლია შევქმნათ ცვლადი, და განვანახლოთ ჩვეულებრივ.
//
//      __________________________________________________________________________________________________
// 
//    let -- არის var-ის განახლებული ვერსია, რომელიც რაღაცეებით უმჯობესია var-ზე. P. S. ჯერ არ ვიცით გაბრიელი არ გვეუბნება დ;
//
//      __________________________________________________________________________________________________
//    
//    const (constant) -- იგივე ფუნქცია აქვს როგორიც აქვს var და let keyword-ებს, მაგრამ ის არავითარ შემთხვევაში არ შეიცვლება. 
//              მაგ.:       var name = "საბა" (მნიშვნელობა: "საბა")
//                          name = "გიორგი" (მნიშვნელობა: "გიორგი")
// 
//                      var-ის შემთხვევაში, ცვლადის მნიშვნელობა შეიცვალა და "საბა"-ს მაგივრად გახდა "გიორგი"   (იგივე იქნება let-ის შემთხვევაში);
//              
//                          const name = "საბა" (მნიშვნელობა: "საბა")
//                          name = "გიორგი" (მნიშვნელობა: "საბა")            
// 
//                          ხოლო როგორც მაღლა არის მოცემული, const-ის შემთხვევაში ის არ შეცვლილა.
// 
// 